[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
7442
27878
9601
235
4004
10636
19121
28648
22737
10935
10922
29296
3263
8194
17799
19897
929
23926
5933
19052
715
25945
2281
10893
26694
8
20097
30327
1602
23897
4274
6762
2545
13778
5091
29584
17281
17983
9614
24058
20163
25572
1845
10446
28438
10300
11160
20428
26526
25682
12163
2750
11693
9410
5292
26366
15912
10723
10658
19047
6809
16328
15766
4198
20923
28041
20781
13178
7661
14547
20431
3848
15469
23349
8299
12520
9805
16575
8641
15316
8224
13343
26307
18947
8679
12052
27145
25483
7424
23308
7251
8100
12567
1654
2106
10039
10647
5540
17857
4397
11962
20788
19339
8258
25658
4529
12021
11100
30181
749
29099
20060
28685
16037
3261
14485
26363
29555
8766
18229
16430
14684
27370
18371
5697
9023
625
233
21857
21534
12153
28682
29179
2103
487
11819
25504
25131
8327
4018
29192
10974
16249
8266
4685
22542
13114
104
13839
24808
11342
19855
9019
5219
8202
18128
1396
24583
28503
21473
29627
17362
17170
14131
5192
19433
5216
22382
14232
6494
26336
9979
25163
10411
6517
2617
1053
5609
25130
6005
11513
8513
24073
10449
30139
17062
16648
22160
12248
28232
1202
1292
27013
12196
5379
1065
9925
28018
21440
2286
8644
9628
16042
4925
2970
26564
85
25585
26313
21871
5602
14950
8808
12790
22253
3099
14150
16045
803
24540
21326
4836
23192
2090
30100
18430
13688
22131
881
8147
1317
8456
10645
19604
979
11295
12367
4355
3291
5368
28394
1433
17060
21114
4106
9210
10722
3144
1943
3110
18496
27665
21209
23904
1030
17861
3644
29498
7915
25179
16337
26417
22666
4747
8503
15707
4054
22014
3292
15419
12331
6082
5489
27095
19269
8146
10674
15475
2705
11414
2797
6197
18851
25145
15107
2738
11973
23786
14824
17256
21618
26537
23503
29547
25203
2484
8189
9955
29322
8414
4873
25398
15991
27700
18244
29731
12459
14501
23084
28900
15085
20990
15708
5756
2859
25219
26393
4876
14325
4039
3001
3844
24586
4767
28957
29956
26154
15241
18736
7994
22274
3994
29525
4969
10879
2337
9810
1730
3519
20414
16868
19227
6637
12960
8729
7469
26096
19636
25473
705
23316
1586
10026
27308
12590
7710
28776
19642
18529
2187
24007
28943
3780
23415
22480
23880
21686
9283
25368
752
22920
1834
27779
9737
1126
3719
6288
2990
13462
15305
19934
18417
2628
16542
14208
29401
21159
22705
11766
29003
20244
15318
27151
13607
11568
2224
16051
28396
19886
924
15847
29344
8335
6635
24965
6130
24169
26615
9043
27063
28332
28860
1823
3262
22157
26669
5046
13846
14477
1258
13535
12246
20508
26568
11402
28461
22197
12446
8718
15395
3037
22690
10937
1826
22241
28099
23468
20447
19226
29842
27
9861
12631
15043
8251
1242
12235
24053
1451
13470
28705
13712
2832
8943
25672
1211
23796
4472
5346
28109
3295
3934
28025
26729
7464
2965
6266
9597
6316
10811
10620
2124
2240
17525
23635
220
23651
6189
4159
22812
11760
28751
12660
3218
726
21748
25427
15465
10063
22495
29847
13229
11955
26238
24705
29504
13995
3470
29992
19728
21552
3042
274
24445
15785
9963
26765
20458
21771
25212
11259
14489
25843
14051
5120
5897
12061
9004
19800
16456
18679
28874
18890
29000
24593
13489
21649
8067
17675
15647
12998
19328
3382
20850
3240
7800
24457
6653
15439
18319
21004
6400
26934
27091
11672
19340
10979
1004
396
26754
28543
28136
20531
4428
26437
1394
4430
5144
8137
28133
30292
3319
17018
7390
6200
1225
21344
8022
25157
16157
17937
21853
24766
13971
17821
19654
9895
1357
22103
23182
1744
7481
8223
8322
648
13767
1938
13447
20669
2066
16754
10238
29235
4938
18239
21092
6636
9935
2199
18740
13374
25469
27160
2494
17804
9981
11349
25387
18754
17227
15098
3636
10531
23832
5239
17494
5111
6285
23146
9428
8346
8222
6049
15532
4496
27173
11846
29057
13882
21694
19551
19436
15682
5233
22314
8773
30249
22410
23619
21105
14186
27454
17441
30283
6203
29649
854
23259
3249
29038
30016
11688
21481
25085
7923
12443
21554
7154
26328
30208
23945
3664
14668
13355
25277
10037
4235
18911
9755
2910
23652
1116
17701
20328
2446
24360
12113
27323
1390
6750
16902
14976
27427
25257
12206
5012
27357
30241
4470
1222
27950
19574
4772
12763
17969
15604
27653
14145
27380
413
16133
24723
3095
23052
16122
3682
7286
20326
26462
29095
19938
25133
17202
26725
3064
19395
22456
7510
10551
30271
8019
17058
1629
20866
21870
13658
9007
17568
22659
15758
10504
760
20565
25986
19492
24748
12221
12772
24558
16825
19078
4299
3696
22007
141
9538
27322
7232
9192
16640
17997
30096
20715
7052
5931
14306
17325
16511
18728
642
12489
8750
6832
27762
6380
8929
22311
2206
5574
10042
18970
16614
6180
5710
28392
18505
13516
20592
25112
20448
18451
24656
21720
18359
7077
3145
12640
23404
3011
20089
26856
5238
8693
17409
9090
18985
12170
17014
981
16957
26823
22569
10596
1185
1951
10059
9680
29207
28084
23372
53
8209
19319
27078
12373
6837
18785
8139
368
11497
30072
16856
942
15784
23261
2133
8836
927
3712
21874
29640
26082
8612
205
24199
9531
13163
17080
14743
3623
29732
16247
6353
28010
27369
11732
9866
20010
4526
28428
20782
27321
10874
15303
23532
4837
9672
1506
23953
12482
11583
12100
12029
17515
14018
18313
12075
29869
9273
21357
19506
1662
15972
7493
14328
9671
10077
23598
15683
4740
7634
10260
20062
5298
23743
4438
7906
7360
2166
25
15506
23452
13716
4745
13032
13433
7577
22736
19116
19781
29976
22325
3385
27397
7342
5531
21322
11057
13821
13554
6527
492
10760
17653
12766
28709
5834
6516
22986
12846
15069
24569
17954
25501
18067
16274
1082
29212
561
10204
3918
27363
10841
21015
4807
10539
11526
3734
14395
27166
10274
8842
8237
18532
8711
25442
18834
13282
28965
29265
23025
10646
2410
13435
8482
13700
22016
7875
27331
20983
23958
3662
28525
16576
6680
15014
25848
27908
16190
19335
15830
20791
19910
6336
12553
17988
16638
26041
8169
7558
18542
27360
4197
7230
10941
1879
19585
7848
20714
16784
23829
11021
17404
5718
12710
20634
18132
8282
7702
29940
27344
2922
26855
21719
29144
16276
5420
18787
18581
10133
3494
11371
5119
22574
24100
240
20471
4898
21949
28628
29644
22447
25496
21371
4479
16572
18661
21938
9808
22993
13363
23480
3414
24822
29625
11419
11703
6872
23624
12452
21079
11243
4939
10335
12657
20810
3328
17401
3254
26103
14301
17696
7799
20231
13916
24426
8651
8164
16240
28256
29541
19089
2165
6259
1882
17255
7740
25597
5373
4471
11020
19375
9498
9379
5112
25750
29405
5512
3828
20593
1562
21942
28964
23048
27991
15385
22392
10750
5089
25367
8126
1063
12754
18561
2862
5015
10206
21680
22464
2861
15314
27572
20048
12672
30290
15143
13613
27067
3618
7523
14244
7341
21785
17434
9000
14949
6480
29610
10639
12056
19954
17167
19057
14823
9555
16853
13337
19709
30131
4260
11327
7137
22443
15826
23279
17883
20619
19104
6675
2115
26928
12742
11728
8073
20776
14242
23588
6056
21726
7301
24101
24789
25284
16021
11444
29015
22275
1230
9397
24659
17144
23520
21695
29785
27432
19826
25643
24158
11080
15927
10630
21655
14873
2954
15299
19912
29307
4441
2816
3748
16325
391
12125
26748
28514
10067
22949
29628
27564
23980
11663
15360
5594
17935
19533
23516
12534
28023
26333
23558
16804
19129
29832
28139
7158
10724
25117
30353
23519
21450
24210
22396
14523
22416
12659
18302
21804
25174
7257
20908
4534
16294
4575
2169
12614
20319
11790
13224
9376
3940
9815
22208
10148
16929
19497
17918
21692
8756
18455
19641
13170
14142
8045
8895
24066
13737
3949
10786
6851
23700
12369
1989
4920
20726
15584
7659
10988
16964
7269
458
5433
1995
13212
6622
4950
9437
10821
15337
3756
8487
23513
12256
21883
25541
3043
2940
8588
13208
24714
2969
4481
19892
10889
15562
23982
28898
611
19965
15185
6030
16802
24035
21378
25716
25819
28205
23978
13721
3387
25563
25129
17309
21542
24094
3035
4036
13895
498
14454
13174
19644
27612
16598
11707
4948
2055
5669
14455
29243
26183
14034
12872
15526
29704
1120
83
7247
17889
20015
4990
10520
15428
28007
5037
25918
30333
8174
14626
8576
27436
15411
5371
10777
6284
24162
24061
21987
8609
21738
21603
12868
13657
3499
9533
5663
29810
698
24823
13881
12202
1374
29538
1406
12425
10452
12966
19458
5203
5809
5124
11469
23576
20510
4604
24616
25557
26108
1341
9742
16883
25556
5704
17382
21251
14841
22793
26059
20168
6221
25565
25648
15658
21243
24041
22504
20817
19948
14123
20270
27893
16230
15848
19429
1912
17723
1862
9036
20616
5976
2125
7078
12186
9108
6239
12023
697
14221
2502
28476
22596
14560
12414
24014
14765
20607
2186
394
24443
29523
26883
5320
6802
20823
16182
1781
16985
8350
8184
25169
26639
15979
25080
16793
19956
15842
11252
5232
18594
1539
5084
16416
14777
8790
6231
26500
5982
25882
11120
3553
6408
10382
26142
5890
23475
20185
6123
7241
3970
12268
23601
6616
26743
17575
12521
23394
25647
884
19114
27969
29879
6437
17913
7977
28316
17130
27656
20241
6312
15536
19085
7961
8525
13814
20548
16422
12321
23526
13353
28674
16119
23347
24465
24838
12091
29533
12819
4953
28375
9995
4677
20693
27722
16931
20265
23397
13589
2322
9860
3803
15331
13869
2601
19539
21329
2877
11630
28614
17488
20061
4630
16851
20852
11220
18600
9907
30020
9287
15745
8208
18448
23722
14360
2143
9994
28070
20723
10816
23774
3630
13621
18483
4139
14728
12855
9268
22633
3788
9508
2709
13720
8924
15520
8565
18865
10050
4298
8307
17907
30104
13562
19366
8619
3603
17337
9507
5630
7386
23120
2757
18180
29345
23395
23121
14654
15731
14364
14847
13125
15941
10866
2747
19701
24438
140
1102
8357
11026
24926
4224
12706
7471
17040
4368
29164
15234
1253
10819
17908
21828
12788
5481
29455
28204
8812
25921
26221
24352
15398
10745
19616
4980
20950
23969
2148
22204
14846
27200
7057
9896
17138
24327
7531
19154
27450
2973
19401
1869
18855
30120
20201
15301
8149
20481
26311
4759
10019
25290
26580
19812
19842
24167
13994
10069
18066
26766
16164
16567
30172
23355
26302
1342
10025
7225
27349
24288
25756
9042
14764
19286
19816
24132
9590
16163
14837
11793
8979
25182
13467
8311
24651
28329
8242
1966
24909
3725
24179
836
1429
27683
4934
8106
5836
25198
22613
8080
2995
25930
22224
19396
25008
21526
23152
18540
17572
3784
1746
23789
1881
4940
7505
3822
13962
7118
23648
20449
22792
24703
27506
9053
17126
8935
9421
454
5682
9302
11283
1849
20931
29157
25377
26897
26927
7821
12303
6793
16506
8038
22721
13091
16495
15794
4304
13258
26300
3877
10898
7410
20308
16079
7548
11255
5310
5878
13697
13299
419
26034
23628
13603
21910
8709
28144
28909
2455
5083
4585
26492
26825
20614
9765
17065
11178
12843
27162
5555
8757
13569
27928
29902
26719
5475
18226
18068
16538
20559
23249
6884
20227
2610
13177
460
1548
8875
25086
3157
17597
27139
14165
9351
26455
18790
6788
30250
14656
30299
20006
29065
16513
26315
4754
27168
4522
17234
12975
8739
15094
5683
15315
537
15130
24670
16358
27660
23727
19224
13029
9528
13783
20346
20909
12006
15656
23717
24372
18602
18076
10341
19061
2269
25859
18743
13537
7440
6674
22445
19507
18079
4321
6413
10746
12983
18870
23150
15509
3341
29113
30111
9717
25634
26797
28291
27993
8366
16316
269
16459
8343
24111
26163
19462
4541
28509
28637
7708
19033
27966
450
25839
28362
18268
13859
11296
29077
14045
8183
97
25240
29449
30099
28145
17482
22977
29054
2568
23248
11606
20656
23669
4856
3083
24418
11396
17229
1973
14962
2880
9003
14868
27649
25024
23860
9141
28549
9148
19382
6228
28675
11006
5703
11010
2856
14776
12582
19540
19013
25047
10127
10505
27203
7689
1918
28491
22367
25944
8396
16977
17707
14409
10668
3545
20916
2294
5193
1381
4253
15667
4275
4053
15300
28466
19139
5660
11662
21590
14380
16150
3025
18069
11068
16647
27133
29292
59
25638
12681
12995
13963
26050
22649
7987
11843
29056
26146
24798
25316
15531
27723
5451
25606
8997
26862
18341
12921
13327
7809
11118
115
20164
682
3140
23132
19469
19438
20212
11577
29005
11588
21010
23091
1040
12597
20904
15096
16023
17081
15788
12600
26528
3396
4966
5948
16094
5504
27836
6251
13317
11777
16189
5844
17510
17891
10455
3134
5356
15886
4743
26879
10689
20645
25849
3582
9740
11359
25467
19254
4581
12899
20019
6989
17919
8528
13347
20677
25687
25828
21517
24964
7604
4077
12507
17646
4211
3241
2598
2099
29112
11137
1091
18499
415
5131
16234
127
13458
13872
3568
11121
26898
27196
24416
25470
11206
6819
13253
16524
4524
21721
25946
14610
24195
10845
2351
3827
26178
5421
1742
22463
24642
13707
18047
27901
18282
9522
15983
2775
14497
7329
29522
20429
21364
23352
10284
25344
13256
7359
18670
22913
11375
10953
22652
27583
6594
22502
22459
84
16574
20403
4365
13445
14365
29652
24156
5079
18560
14795
14521
4641
11989
22419
7419
25657
10152
12090
30335
22799
5635
16193
13918
14201
11801
9146
3963
26272
24455
17926
28533
20585
4219
23534
29081
4324
19509
5081
23732
945
9881
18789
9730
6313
21906
9197
5296
614
1274
13439
24786
7547
5949
18060
14314
27518
22355
27927
16304
15355
16436
859
16997
8974
7788
13046
27438
25812
15281
20921
16668
26848
2241
10661
9495
23887
10138
26772
2937
28413
8950
11065
19753
136
19542
24824
28131
8123
28408
29726
5667
26594
22578
11628
513
22639
25993
19688
17960
17790
3526
23641
26165
19893
11937
23134
12655
5956
3840
6984
30294
29210
21653
8606
3046
27359
14431
16410
4290
5947
10872
7429
9155
27623
19472
20785
5032
19849
28947
4353
20134
20419
5678
4875
26444
16582
8676
13610
18675
4452
22511
18058
19885
4557
14621
28568
14751
8823
13272
11395
15417
24640
10096
18587
29646
24715
19793
23266
19673
5221
21449
25124
2222
22475
29936
21744
16611
18179
3937
2943
10355
29618
27460
446
21467
4165
16621
29260
26509
6789
7955
18942
27383
10358
13594
17644
25399
27134
23586
9100
28178
20688
20801
16071
11818
8247
7279
19983
16683
25139
16874
16752
26810
14405
5317
29224
20204
18332
8696
4721
20993
17738
28457
21803
19175
5506
29955
21002
24427
14646
19351
27714
26890
2720
22945
19298
3781
23137
15248
3938
27767
16735
24194
24733
23798
29978
24626
17247
23647
17225
17730
20892
26044
18426
11019
11326
10564
16426
23888
27235
22623
25583
21613
29058
22191
19349
27374
8613
322
7002
23544
11491
3561
10783
24790
7914
1990
25403
15460
6931
1841
4180
6081
23382
17372
20237
20944
17869
19264
13471
5061
9115
15792
18309
489
6570
47
21166
27699
28553
29892
16266
16408
26554
21490
7787
14450
14695
26150
23008
19733
28261
4655
6882
19301
21361
13906
9688
463
6598
4186
839
10160
440
30005
24377
25749
23010
3737
12055
24078
21524
26424
12891
2395
4202
13503
22378
22935
976
6767
2932
9731
21833
11426
1706
20149
29631
22933
26099
1776
16865
19324
1800
757
22051
23015
10532
20728
23126
16360
29503
28633
3109
21259
10082
5534
4726
15276
633
20318
28448
4971
26670
29656
22758
17242
20843
11143
4741
24601
7773
15313
2739
28322
21953
14587
30186
28917
13990
28768
6315
20501
13045
30171
18871
14757
20868
26117
457
63
11944
16634
12076
20668
28581
2046
3449
24875
19922
651
27829
26241
25654
10211
1764
23381
10676
7530
17640
30124
969
13239
4806
25486
24413
7643
11261
24525
28497
27873
4143
29277
23940
2930
22743
19083
5121
20287
4578
28978
4530
1448
24509
29508
27375
5428
13529
16996
7739
28823
13306
10492
11942
23276
28313
25985
2884
3998
12739
9563
6519
30006
22216
8579
4967
9694
19552
27336
11192
16188
5336
14971
28283
27405
10004
4140
22728
20665
9947
23622
20862
19608
26475
25576
14298
21823
22909
24711
17672
18917
18895
6454
9284
29430
13634
26566
20304
7990
28234
16014
28274
1013
19019
10529
19508
27077
15165
14940
19330
11999
8286
1408
15006
29051
10154
15177
29578
11341
2466
29114
9424
15565
4800
7256
3049
2008
23485
287
14577
13328
28426
28102
1444
21654
8726
11893
21809
18443
10506
18040
15172
25436
2611
23420
3302
11195
20440
28630
29759
2416
16207
17818
16440
1201
9519
14597
11631
4179
5644
24261
17984
6921
26440
4288
1812
6279
4520
15463
27963
2131
27682
9117
18100
2097
9830
17082
1106
22263
13598
12633
8212
22460
2556
6987
542
12041
1894
5538
8390
9610
1575
28376
12989
21457
10703
11103
15057
17991
10245
16860
24469
16616
22626
14044
18817
23220
4006
3745
26687
5424
19640
10291
16838
17289
11382
6844
113
1955
28353
18708
14203
5408
4731
3912
13248
19637
9486
20188
13868
16923
19143
25013
11305
11029
12481
8060
5533
27674
10108
19633
21792
14662
23332
8736
4332
4820
94
29011
13123
26240
18775
14313
15374
24077
4667
22821
8302
13206
1523
2338
10521
17436
2663
5308
11912
2744
29823
25230
8725
25970
4213
12162
8313
16762
30037
9840
1809
29475
27018
15280
26227
6673
19694
3866
6370
22593
17856
8462
729
12108
9565
13570
11514
1941
10773
2698
24795
750
20063
25318
18304
511
9315
16543
20957
30078
21396
15489
254
30232
9067
10588
8536
19477
7865
358
26213
12410
2109
21931
7197
23206
23339
2550
10297
20205
22039
19500
28161
15953
1372
20389
6958
9635
25125
9985
4926
8421
27679
8716
24574
25888
4123
6608
7180
26350
20599
8210
9096
15697
21670
16475
29872
8646
15019
15959
5180
11538
7579
16365
10250
26535
23549
8102
17350
28021
10020
24905
17853
5377
26443
6458
4426
11528
13627
19463
6707
15274
10169
23461
26061
17332
27688
10623
17413
27163
12231
16595
4330
13036
26953
30227
18916
20408
24501
1858
799
5141
12890
20340
15214
11390
29289
2899
25573
9676
8610
4819
23118
6268
4995
10511
6957
8082
26491
27205
19595
20348
23602
13083
20605
13884
18488
28071
24109
19317
39
18264
24350
6601
4528
18481
1957
9356
932
5416
29218
23889
17048
10365
21191
21343
11956
28350
150
10228
1726
7456
13244
13197
25358
9534
18950
30071
21777
15258
11654
13501
19808
3846
18231
19838
15932
21
2052
22128
1391
8857
23707
17393
27865
1619
6530
7009
17605
16331
18468
6817
25376
16829
29604
8057
722
23424
24741
72
7878
3829
14339
22747
26538
1921
24215
14372
8129
8744
7908
17191
11506
30033
26506
636
473
27328
4096
9585
2881
4855
23548
29146
25747
23101
25593
27396
10741
1729
10734
18792
11350
2147
28487
27211
12126
1927
639
1880
4225
4190
7910
26539
5077
11699
7281
21820
20563
7876
23125
17246
19794
2685
27142
29796
22107
29036
768
26570
14756
25536
4243
14568
16870
24000
27442
19662
16111
20415
20146
7868
25751
341
24760
26000
14094
18131
25540
23055
14936
17120
22017
9211
10247
18333
27414
27043
29772
1482
11408
15045
23653
17055
14937
412
89
16450
684
29255
22730
23407
5199
13257
6489
13155
15476
27482
29545
6922
8549
5108
11972
26226
17936
22333
9383
29819
13440
20461
22916
3333
22775
19813
7832
7196
29557
19756
17539
15142
1775
8899
2576
1848
2173
1958
17589
13415
16745
3376
15401
27117
18142
19390
18845
21405
15592
26802
12769
15063
15207
18888
29271
14401
8233
17552
20635
23533
602
3422
1263
26589
27987
5407
18197
23035
21739
9574
28505
2787
23837
27805
8843
1667
21793
29409
20372
2825
7504
10593
18266
16209
17449
26457
9778
27510
7174
2481
11903
20942
23483
19311
28517
23090
20729
10897
29699
6327
18504
14732
6728
6917
25071
1405
5049
23929
294
14702
13879
4351
24300
26624
12519
26285
15938
29450
24260
18689
11794
26397
18198
11725
28905
12148
26923
13104
12349
5182
25346
21275
19404
30164
4000
23477
1438
19521
7278
24252
15200
18339
3324
15454
20736
13674
3161
21890
16850
13809
3605
13843
6964
581
1678
25053
28244
19082
1997
23910
6152
25143
30075
15112
23272
25171
13553
18289
1028
931
18634
13769
4751
5645
26646
28791
8093
24332
20718
9198
30141
16153
325
25554
2834
9154
6970
3290
26106
15340
6191
15456
21244
6619
14678
23864
26209
28535
21054
12935
2855
13143
719
15436
14531
1885
20258
15736
16954
5840
21980
10931
5826
13140
24238
13616
23400
2155
22774
12174
1600
24989
6948
22439
11969
29613
19108
20748
21689
15030
17029
2233
627
18115
30057
8232
1131
5965
23960
14944
9152
14419
14269
26175
5732
10123
26373
6399
15361
22685
21285
285
26017
27155
13167
5898
8434
19200
6042
13130
4464
16397
1692
24948
12675
3103
18247
4279
5962
10208
15265
10470
30169
27962
10950
23937
19391
10749
12450
15062
4014
23517
100
11975
26219
9167
10268
20808
10443
10436
28845
7145
3728
26141
18961
5832
10425
12398
7458
19447
910
6171
8088
15004
4466
11765
20528
12176
5708
20636
5432
18380
25511
24980
8942
20121
14946
11674
29831
18374
25955
17503
7382
19952
3601
17199
7731
9248
24985
20314
26616
7685
19261
3812
26174
16271
10543
18862
23174
12636
25333
15987
4065
23082
1
8131
5047
9897
19929
1890
17711
12017
6033
11154
6625
8424
11282
5629
20289
14896
11542
25508
12435
25829
13274
15431
1378
27353
8868
19554
9707
24233
21873
16867
16264
23817
5727
6008
5277
27475
24033
21245
15581
27051
4049
8856
3517
14286
21239
12820
20337
11172
7805
1050
8347
16939
2188
18290
4444
24012
25343
26832
28042
24213
16403
17348
17043
1275
109
10390
21891
23754
6663
22458
263
8984
7598
7918
19889
16578
4422
2732
28057
26562
19696
10324
22762
20357
29601
2388
20046
1613
5271
4044
4220
7690
7211
9426
27622
30156
25162
15259
27703
22173
9062
11845
11745
20762
1815
21753
19464
15230
19820
19316
10837
15492
781
10631
8728
10429
1675
5914
13050
17184
11957
2673
28516
4727
3163
19901
4657
7640
1644
7367
27434
23848
18327
15405
13853
20603
17615
1271
26661
17168
17006
566
29080
16608
8991
28363
2136
22247
22057
19877
24125
17032
10864
23737
12701
29908
3269
6509
30170
6553
3639
5351
19683
14421
29882
26189
22958
20235
19255
30150
26465
8771
22611
10677
10188
26267
25262
2118
5323
18354
4092
6703
1587
17265
11556
14213
19874
10438
2301
20150
5532
5854
27070
9933
13977
6485
3479
22815
19273
29891
22675
8043
6394
5331
3053
6323
15221
11817
23756
4631
19125
3061
14616
3795
8372
20070
6337
13577
28287
9532
5043
3071
29183
1593
15349
30192
30185
9980
472
20080
22347
27294
28783
16483
20194
16675
6258
11990
23173
25105
12576
27854
5285
18003
29403
15306
20763
17
28475
22999
21794
9779
15048
17909
2316
28825
3378
26664
2033
15490
29088
15774
2731
21936
8884
21894
12165
20302
27906
5263
4625
20864
13069
12564
13969
20208
493
16820
7364
161
20078
15225
432
8360
16988
20803
19024
21070
1621
6842
28572
9763
5524
25807
6972
21265
16009
23868
19370
14533
4398
8448
6986
10824
10823
3923
15432
17601
1370
21940
22683
16807
11624
6805
10715
10569
17240
19062
12311
3467
25942
24548
18755
21666
26297
20445
3764
809
16813
20100
9620
4556
14657
13656
18206
21776
21149
75
8774
28171
19250
17260
3953
18368
12530
3133
9309
25800
1529
3714
17357
27399
24680
13261
6567
5637
26060
23612
13093
29660
17709
10403
21455
19352
24267
2975
8620
15556
18190
24960
21624
13420
23835
24754
336
8994
13315
14818
5197
1301
22249
10380
2114
2168
23209
2765
24595
4370
25984
18130
28954
13296
18133
29797
11536
8962
23226
6048
20193
6040
2540
2247
11995
6939
17941
14075
14754
22894
9384
25732
19373
6368
14504
14272
23122
15037
3775
24624
22028
6719
11561
19597
22293
10109
7054
21389
24153
17942
1811
24675
4403
20042
20064
7851
1780
26410
27740
5828
21690
10701
5288
19931
4440
975
23640
11319
20404
26494
20796
20126
22338
24982
26289
19911
17435
26671
28248
891
29295
9783
27057
20259
9128
582
25263
3351
10040
11763
4827
25791
27826
3870
25846
18801
3211
22885
13829
2277
7512
9771
20867
7649
443
22235
18193
4230
6968
17214
10383
29323
13232
6629
21611
16032
5655
15629
20972
2693
21899
28463
9288
1243
13532
7222
20783
16631
2634
15901
16609
11115
8240
3658
28000
8910
7722
24735
4815
29598
12835
24349
27731
27515
29085
10902
10508
16433
6406
22468
2911
11034
23636
16205
5418
16343
12862
30116
13805
683
18456
15427
10954
7694
10548
95
18647
21296
20023
1459
28079
25902
825
2711
3239
28977
101
1423
24660
13693
20621
29708
5750
24581
27185
3409
550
15010
15797
25822
1922
26631
29074
7381
11109
23265
9045
29388
28683
25390
10454
21151
16090
26864
2493
8927
17845
10015
27527
14076
19503
573
24755
24483
3787
22483
4418
20316
7172
17150
9919
8079
6230
176
5430
16399
20297
14651
4286
26254
7952
8170
7852
5352
1260
24476
10193
21632
15770
8358
5162
20770
8187
26710
3673
23951
16532
22499
20005
30048
26709
16268
26804
3069
27183
4983
13602
18901
24602
24062
28530
16441
20793
5167
24696
17584
29337
21877
18990
3576
29139
18034
22217
25116
17116
23780
8786
27130
2213
12726
2365
4502
16789
18286
26376
7005
29730
29462
1466
3768
26938
8415
2845
14812
6733
189
20863
8802
15295
30317
11523
20496
14509
2341
12965
13431
12757
6206
20985
14153
29571
10329
19933
20631
16744
6147
26383
27339
6376
28188
23668
21103
19758
18584
25037
25781
5522
25044
10164
22634
24731
17550
13831
25372
5170
6122
19891
18234
262
23833
5622
19611
14665
29291
1994
1413
2543
21330
717
17112
26597
20127
14392
7130
6924
18567
24889
22467
6217
417
6838
23620
455
24953
13566
2637
4367
18641
8956
5071
8969
13198
29560
12876
16641
10836
1255
4491
20860
14555
13291
19239
4450
22631
25039
19818
19726
17091
29239
16918
23496
2820
23728
10447
8640
24059
26224
12907
22029
24579
16671
8245
18330
26964
8499
6430
28247
29208
27534
13490
30242
10675
1034
26715
2327
7543
1279
23363
12798
7248
21308
2352
19697
20084
1304
24608
10018
6996
27955
14989
19183
4238
5597
7533
22551
14149
17490
16507
29695
27620
7100
28704
10863
27373
29206
30318
6912
7084
26901
14960
398
14556
26852
15180
20708
12086
22400
28373
20609
28483
8112
3015
13575
12013
7837
9889
28441
6551
6836
12502
5186
22469
17329
14549
18912
3384
28050
3405
4789
23384
667
4620
1334
3335
1649
26312
1658
21210
9746
12639
12814
25172
19193
15710
8539
27932
25077
369
26129
16653
22512
20195
2838
2132
18861
28066
30261
7433
19857
28695
19545
24904
6444
20138
17741
9557
11950
21315
21486
25256
10235
6238
7027
1012
7586
4169
27832
3587
22310
21230
26992
23438
20393
2547
18471
27843
6162
21973
4024
1711
2649
21884
23006
8404
28083
16707
16527
18749
8425
9760
6046
14863
10637
19272
5983
21333
8652
1232
19796
15206
2745
27495
21967
24683
12223
20124
9056
18479
15485
15002
18874
19177
24222
18741
30260
27027
27107
6260
3054
14670
2733
30030
6994
18716
868
27554
5231
3372
12299
25245
22879
7947
13834
8523
4361
18454
18552
27691
1155
22924
29087
2425
13894
1414
25345
2034
19203
18926
16629
16424
6110
744
23814
1634
11653
15102
23701
18573
5870
2959
17682
3943
25362
19389
26104
27228
4162
18284
22867
8544
26015
10350
11451
21391
694
402
24502
6141
12092
19431
20900
20092
26111
20712
24547
28878
16766
23258
4305
13101
19905
3685
4483
4587
25700
8860
6309
9088
22759
1246
28773
6157
7654
9575
23359
27672
21172
8821
1712
22635
7614
9656
25802
3228
19695
25977
11924
24756
25905
2553
6944
10170
27925
17132
7006
17816
23570
26007
9857
11827
18564
1633
16367
16346
1191
1647
4429
14582
9850
12376
29663
28017
25962
26951
1817
27715
28224
13322
23921
3520
14997
12958
18703
11774
1005
22490
23185
23498
2597
16088
6709
29657
28054
9005
20284
4363
8747
23567
28138
5835
20702
19268
14469
29812
23360
27100
26846
8221
9698
7294
5693
5907
6604
24550
24937
22553
14083
17808
19195
23572
31
1058
11048
6084
1068
12423
23643
26587
29334
16544
27243
20118
26075
3279
16526
20272
21503
17278
27852
5347
16338
18095
10713
21728
903
11248
4714
15903
1042
6079
29894
6431
14838
5801
2687
22936
11318
20643
11000
27073
11216
6830
1143
24758
22133
29256
10145
1900
25489
11650
16046
16846
30166
7212
6743
745
2342
7322
22942
8865
4636
14859
8645
16876
15073
17303
1295
26508
3206
1385
2271
9377
27161
20707
27644
16248
19624
6159
1101
17751
19199
27372
20534
7048
21579
26795
21267
1940
4124
7233
22350
10483
15168
12936
14104
1407
3668
3552
24315
20108
15677
7728
25743
7033
23236
9074
28597
28979
247
27507
11268
25612
6727
5913
26947
16106
18906
24916
26132
28645
9353
15671
4816
5191
20639
15931
7333
7267
8629
484
29377
15684
19647
7712
2574
27290
30328
23283
792
9057
624
24941
24636
7934
20482
16283
18943
24374
17692
15920
29325
18490
4550
17728
6581
13567
2340
3314
5874
20824
7146
23047
13267
1773
15690
9201
14021
23494
14289
5736
24998
17083
25666
11277
19972
25154
16687
8915
21812
19209
3282
9189
22741
8849
19110
3799
27400
21387
12755
9084
14115
24376
12214
7648
4113
26095
19171
4813
9177
21678
21112
22704
29996
24526
4075
28789
29055
11136
1642
25421
25990
26414
25303
5691
14310
12671
9926
165
19843
8667
721
21161
2686
22860
5917
22570
17251
27684
10091
25907
27519
18171
2948
15533
8572
29519
18548
17473
13892
14741
3592
28570
26064
2394
7498
20349
19367
24134
18802
1636
3142
14968
3116
13364
1608
17190
30291
261
25160
27169
1096
29213
18279
30331
9373
29938
27052
6949
9667
241
17726
23614
8075
2309
28785
15650
12874
9076
15104
9937
27937
23336
6004
18847
28700
18804
5060
10610
735
26449
6632
21454
15879
26863
1865
25596
20678
25278
2612
15951
1363
8046
8961
2869
12712
6222
22045
23531
18362
1784
13953
26184
28780
12687
15780
8763
12683
24127
11113
21684
8444
13580
7352
13961
15023
6305
12181
26838
28765
14024
15181
25818
21985
18805
10766
29269
13346
5856
29922
12964
13912
4132
22330
17419
20706
21700
5088
24126
11614
9480
13597
14245
25026
8515
26390
24775
2478
3547
26261
7627
13728
27584
24839
834
11979
23783
27513
23655
6556
8936
19258
26877
21001
2468
8577
11455
22641
20225
4753
17021
1215
12109
6609
11372
23054
19151
23087
23115
22282
18387
8905
24227
21049
12650
15849
2799
27545
25049
13058
1604
5580
15064
24433
21531
20370
5358
13736
7370
10565
26590
18699
18673
24160
17752
29948
17898
29711
8419
26667
29511
26692
27621
28014
29328
6129
4848
29358
18868
15887
4644
19830
1646
27458
5729
15277
24564
25295
12212
13684
563
5641
12802
6367
16892
10225
14510
11926
14828
25412
20764
16691
19007
1838
4477
3955
29816
4484
19529
18527
16484
26656
15416
21519
17180
6646
27979
26872
277
3340
10419
2758
23759
13651
16785
17784
567
4133
18260
26888
29010
9411
14653
1369
8145
1149
9347
13461
8084
21633
2608
14988
23213
9766
21635
21086
3403
11567
27637
9305
24279
28937
8107
11599
6001
10626
23092
947
26758
12986
26208
10045
28197
11200
21276
11275
16318
1121
22664
17293
10695
15925
26370
25110
4295
279
6800
24039
675
13629
25762
11299
8380
10654
27712
12428
13820
5904
20395
7108
13370
7692
7452
16493
10075
17108
8244
841
28838
27926
27497
10318
18502
29937
21424
18812
7242
17470
29638
21914
22796
1324
3569
22861
15827
15040
7607
19941
9988
14403
14452
1109
6900
18351
11334
6439
946
19614
14233
2234
18438
7793
19495
6398
24858
4649
8047
17474
5600
7679
27410
11253
25858
28701
25655
27981
26181
22813
24107
10598
960
24707
28499
3857
11574
24131
378
5350
30180
25588
11691
21035
6060
10139
26520
13408
27265
16515
18838
15636
8567
10121
4648
7393
29858
28664
1903
15354
7164
2523
21299
19787
8580
10374
23758
26749
7892
16330
22848
24542
7087
13102
26617
11552
3415
7909
1343
18350
18465
8489
13319
22254
19769
19060
18992
24246
27759
8717
27879
20017
956
16764
7043
3016
14607
24893
22798
9086
17007
818
14239
3255
1315
13367
16015
7343
29373
28918
29477
8257
17443
4591
29864
13132
15409
10112
601
27549
6858
11424
2376
26803
22970
24468
10735
24717
16158
14331
10343
6225
23491
28539
12447
25301
19660
12032
6633
2375
22433
26918
8042
14296
23861
7013
4291
1033
2157
18966
1036
1453
6868
556
25823
25494
28115
2264
9708
25229
15429
28034
29116
17762
211
20278
12610
10013
20507
12291
2290
25061
9006
14753
23403
9541
1648
10918
11546
7454
3723
18806
4842
23045
1397
25621
28607
7849
17513
1609
28368
7831
29343
26994
14077
24205
14387
7594
17775
1497
8397
28309
12453
16591
3275
3617
29456
24791
1300
8306
26486
11914
17813
218
24159
19837
19822
21121
15458
5642
9693
7962
26214
20073
15835
19259
13638
15892
14627
23049
22009
6346
27763
4388
7902
26090
5798
6427
9560
22313
24503
17500
11991
3404
6383
21088
26006
18361
21764
18228
26784
22908
19281
11087
7304
19282
22973
24225
17356
23862
7575
7376
2849
18299
25431
7900
4917
27329
19937
15673
23674
22501
18727
20495
28610
21644
20662
10215
27531
9932
1021
14880
2374
19560
11276
25510
19828
7545
17638
14118
26172
29339
8553
26433
23295
14821
22343
29635
29622
22002
27011
27535
1630
18379
16803
18127
8914
12198
12809
11139
11304
29120
28569
4861
7804
2436
19920
2807
10440
20462
21030
5048
12913
15525
9959
28908
2093
23324
6220
4916
2048
18211
21008
26745
13423
17842
29642
17579
12930
18737
22199
24514
13678
10387
19265
21992
24371
15204
24026
17151
14525
18476
17823
19075
24150
15960
21084
20450
11700
3188
1923
26121
14729
28948
6512
12573
23705
18837
24448
15111
12900
544
25192
25994
27713
11070
9298
17217
23269
13344
18937
26831
10996
29599
29490
19936
12703
6363
12956
24635
22877
13179
20873
14483
19093
18398
5625
23795
25283
6000
7194
13124
11102
10575
17453
16220
12486
4060
11201
1734
16894
14562
9702
10696
14883
17671
23017
7546
2625
21428
13649
751
21645
3173
9854
10468
9626
15528
24532
13313
22285
4688
19411
8007
6982
12038
3031
1728
6470
27965
16962
7617
8008
14368
18535
2766
27140
4141
9187
16899
29723
22273
8634
25765
12779
1352
236
6891
27681
29180
12780
9075
7573
25649
25853
11880
27439
3151
110
25266
6325
3038
18576
16074
16149
9352
3007
19871
8970
26935
21620
22546
2267
14572
29862
12169
13546
23421
27327
9099
28696
9221
22579
2688
12156
20298
23287
19459
3126
13815
2480
17957
15396
29742
547
3501
245
8713
3085
21109
15904
4972
19236
26162
20618
23108
15620
16017
22287
7917
21747
27819
16347
28459
23362
3260
18177
17110
27448
16912
28815
14749
2304
18259
4492
23128
10275
1266
29098
272
5383
12495
13761
22301
15553
29809
14933
7010
24592
4896
27976
7833
25601
10896
12236
21304
17498
3504
6233
802
16812
9631
27001
17524
26560
14114
18599
30332
22985
10496
6021
9209
29766
3253
3802
17545
7881
16586
27771
15501
13056
10414
8157
28971
17852
13933
20200
10221
5705
19430
13094
24378
14601
10282
6409
25734
26603
30076
27361
10600
7612
6445
29231
20521
25928
29135
13441
16924
15070
25187
10890
10198
11077
15517
12099
11236
7566
7252
11965
12105
17157
5937
19475
4446
24458
22971
10159
5684
10985
22076
24580
24145
11039
986
25052
19649
8799
14471
7462
2390
13701
18848
16557
4384
24520
26691
9212
21630
921
19589
27594
9136
6698
27306
2603
12036
10377
15512
9791
7535
25974
22556
12374
15755
29526
16696
24142
22960
29691
12759
216
939
27330
9608
29676
19815
21766
3796
1321
26845
103
27152
7989
19422
12535
5034
17104
19691
20329
172
29338
876
7940
2152
27233
26943
2022
28958
24600
1693
434
9034
6356
14888
18620
15286
17054
11485
3489
23642
11609
5496
15962
14720
18396
21404
28053
19027
27176
15753
17961
7407
35
5689
4515
10756
29725
26546
11658
13214
20742
18001
14538
27780
12063
2175
16429
13005
18610
11734
9468
4078
30284
27394
3691
15321
647
7567
19283
21074
5262
18378
9921
18629
21852
19362
2760
21824
23297
5044
2629
21044
6002
15344
9497
28031
26911
7693
18566
4592
3288
10827
1897
4147
19672
26640
17208
25146
21476
29850
24530
28058
11075
21338
21305
6623
12719
26155
20765
8418
2968
2770
5463
25309
4461
11726
505
12861
29398
2198
27597
13993
11480
27034
23413
23067
3832
16667
5495
12821
665
13927
1942
29690
28245
7943
22582
10956
17773
6057
12512
1139
9200
13681
28951
1207
22339
16737
25923
3165
7071
14806
12562
14673
14850
5817
29281
3823
23273
24990
12516
22941
26195
4042
26097
13667
953
22260
17903
11792
2479
4473
17677
18272
6156
13223
17879
25792
17019
11679
9646
27060
9423
29829
16141
22290
16334
4045
24113
24345
3693
4915
4567
2423
21125
17847
5671
858
26043
14106
19854
28164
6585
7562
15709
12400
21205
13768
6348
22027
5899
13066
28676
13914
16369
25490
29798
14097
27087
20359
1974
9081
18763
26884
3160
26357
26913
20275
23625
3482
23007
28019
25190
6713
18212
25515
9849
6595
29512
26269
343
2483
28605
25577
8090
1336
14382
5065
276
12826
5598
29650
5413
714
10201
27204
29238
6966
18893
21409
23504
29969
26531
26730
18357
18617
21383
7042
26946
4433
4764
13288
27188
28707
27090
15152
25685
313
13006
5029
1818
15390
29849
23298
4914
21760
16348
11257
7890
6471
25310
5879
27640
4701
27786
20175
24597
29425
24168
129
26926
1128
24946
4752
2002
20568
9060
1380
10904
26678
11194
28177
9739
16967
6436
5341
5986
10132
7729
2753
16540
5013
29718
19661
20926
22823
19630
17477
27452
12847
15969
16270
733
20925
16597
17504
28357
3873
1839
24849
26123
10326
14159
16715
27563
25722
3056
24736
24495
27693
19192
1768
19331
26625
23967
5604
4602
24927
3746
2935
18186
26493
24697
2401
14262
15712
13010
12622
3271
25296
12081
8621
5613
16359
27404
5723
3611
6640
16083
13506
5749
6651
7899
9436
15131
28938
681
4678
24191
3577
15726
15445
1251
3583
18713
23831
5322
18437
27208
15868
13188
16548
15624
16649
2387
22476
4852
6333
13162
1199
25185
28839
24803
4924
24060
15566
1906
21025
15545
8504
21100
3070
12209
2087
3834
26628
18126
17964
26107
26842
24422
17459
23291
1288
13394
18399
18183
267
20553
1308
29999
12651
5959
11280
25279
25228
25892
8398
577
16790
13486
21774
13777
16529
11046
29154
11237
3251
81
11660
17774
11802
16497
16741
27732
21384
3778
5883
5603
12241
7827
29237
14882
21140
18613
18821
12947
6734
21715
1902
27224
23489
27354
23369
21808
22134
3996
5005
645
3604
23950
2004
28986
15415
20478
10180
10379
29895
17618
11091
19036
29567
3346
24340
19878
27676
23524
3540
19289
4799
10942
10433
1435
10205
268
13196
21935
27724
8469
8319
20493
21445
12922
6263
2500
25388
16113
15621
12638
3436
11648
4293
1495
23702
12903
26805
17611
9132
14696
766
13645
826
14586
15716
3610
6432
12344
8178
4537
15575
3742
9342
20973
786
19666
22684
912
16560
5737
10406
18518
13112
24076
16910
10158
12589
28440
14761
19588
12359
16781
20086
3114
11356
7099
20190
8115
18459
4308
13187
15831
22670
11582
23914
17841
22680
17446
27790
29241
7508
14993
10278
27340
25988
12580
29591
5396
4226
21522
22056
5617
580
4814
25862
26950
26821
973
9627
6784
18397
8445
3688
20657
25688
1606
17311
3549
15369
27604
16986
14003
17250
2729
13213
8697
11676
26794
23030
3933
8241
10930
25482
21465
29313
3972
29391
311
148
12865
8674
1672
29930
18120
1916
8205
14256
13886
28208
28168
8416
18107
28985
26517
14101
9387
7282
568
17068
1605
1899
28348
3370
2726
27540
15841
25879
11757
12438
27332
4041
27257
19613
4012
28611
11685
7226
21499
15034
17192
10621
10357
27154
30060
19117
21733
14241
15975
17536
16060
6148
10943
28092
7494
9233
25785
23377
25815
54
1379
29249
3659
6280
24281
1720
14575
22115
4963
18651
1332
10144
21266
22581
9413
28024
26922
8951
7639
20412
4097
22622
14878
1626
8094
10976
14592
18116
24197
15687
10938
8070
7044
27522
23540
9756
17084
11443
17794
28930
11715
16409
6465
27877
3077
2256
24446
19181
18094
22366
8430
1599
13145
6163
25864
1081
19417
12073
22791
18056
18009
15224
19502
23037
12893
1262
8566
6307
345
4476
8811
20488
12661
8300
21313
7422
22229
7748
3034
6661
6039
25521
5181
13399
3640
25475
4411
21160
9924
19928
3152
15521
5676
8249
28796
26145
4271
25144
5482
18250
11014
8990
22136
28390
21475
22921
25574
9623
21605
17805
22844
3004
8617
20730
5984
15857
16968
29279
16217
20786
2134
26659
3550
11362
21071
16712
2317
20544
27406
5096
15655
557
11644
6395
18087
20423
20632
10648
24406
12688
21621
22561
20825
27143
29605
14982
24768
14890
26974
8329
28442
26957
907
15502
16794
416
7735
15325
29319
28983
5589
6272
10634
15869
16011
23755
5255
22448
3619
28547
21142
17319
22873
1456
18884
29290
16585
3294
3708
12883
23744
30101
12952
24306
20727
25587
22170
17772
21006
14068
2194
23923
26130
22575
26504
2246
25075
14954
10088
1866
4427
19562
21551
23551
19960
29701
19137
3430
30059
1490
10712
15108
16814
12992
20101
9858
6676
22206
4497
19997
13292
4130
28615
7346
28103
25392
18986
20425
12205
16965
3904
21248
17343
24704
1934
19621
29171
24123
23797
4312
21268
27453
26586
21995
8745
21732
3366
7020
5653
9390
12372
19593
4200
28341
17221
16102
7114
17689
10246
9654
16650
3621
10801
14069
17979
26712
20865
23242
27066
607
17336
8517
21966
21673
15807
25768
28966
16596
7321
11290
7592
6442
14039
3246
22518
17338
3388
23038
24556
22829
18691
19271
12690
19064
20160
19505
12134
10060
24080
23908
13517
21757
6878
23607
12110
10319
21775
26282
20066
16805
4390
15820
14140
17994
15968
7576
873
29932
12569
25074
12296
17819
6905
7132
13536
22853
18075
28239
26028
2602
29845
15519
5397
14129
1722
25440
1318
29509
20026
1487
13339
25845
11460
14394
3312
7307
14459
16078
6881
389
7205
25164
17328
18840
21349
3779
7291
28425
10344
11836
3695
2019
18335
13311
4632
6547
26980
14915
1291
12286
8520
23893
16006
10947
5452
1567
22839
1400
13184
25547
24992
26968
18236
13042
19689
6176
17564
24931
22496
21921
8083
7847
19173
3562
30107
20615
6310
27260
29426
24702
11239
23573
5016
12560
20040
19490
27202
29825
2749
26874
19179
15651
28510
9312
29993
12087
14254
17206
9668
17105
15982
12538
19868
21671
21904
20186
20072
8664
2599
16195
7306
16278
9382
15884
12896
3558
17139
16108
18470
19452
244
12218
11778
24387
6995
28159
6723
19804
19124
24744
27125
3197
3485
11537
20076
16124
9984
27377
29079
19512
11586
4603
5748
15336
5201
12093
21253
11810
26939
17304
17025
28586
26375
12879
30344
15134
25549
17836
23936
9529
12509
9785
28367
17075
1278
20043
22242
14260
29132
13341
19824
10644
2140
16095
17042
29499
28662
6029
23469
5127
449
1221
16549
28179
15382
13393
13225
17616
4651
1792
11262
11953
9741
3895
12490
16451
14867
3871
7662
20887
23444
2347
5008
12048
23742
9142
2398
26925
12200
25027
9663
28484
5313
994
24449
20079
8568
22375
25478
10998
1962
14189
22323
20333
18480
190
23337
19988
18639
1717
1581
28210
5739
18030
4416
29820
24843
18204
10936
5822
28326
10847
24412
23968
14112
23282
14086
4111
3947
12004
10089
29527
15498
18921
8049
16335
20374
6834
16183
24085
23233
25323
3393
9094
18338
27760
11415
23854
7580
7835
3885
2041
23791
10641
15574
14011
19797
14990
2696
22234
11870
17431
16226
17607
19145
29535
24891
9982
28529
19168
17364
21643
7982
5837
28462
14090
9222
7795
22166
3426
8518
1428
15238
13023
7997
2754
7392
6031
20383
11727
13191
14827
12298
11328
7790
22369
25155
6037
27982
15705
28915
15828
5164
23356
17554
26986
28973
1700
27485
21377
2675
28434
6983
24984
4245
1463
16214
16723
25091
18469
27297
29198
4519
29632
27891
24430
27980
652
24944
21745
26239
26353
9191
28946
3472
17118
2819
3513
26212
29141
9487
18305
21972
467
8379
15578
13919
4196
4104
15373
16394
25550
1245
393
6544
2079
20486
20518
2040
15478
22351
21831
25720
13817
3267
25775
12207
27544
11642
6886
6774
18080
2741
2841
12857
12667
9687
22769
2715
3974
1348
10209
6569
18500
19488
27007
18148
25120
10917
20358
28540
661
5616
10522
3112
9474
20293
5196
6869
18145
8317
16354
16443
26136
177
21901
20834
16134
9569
26066
5905
22956
25150
9350
26463
8403
24313
18604
8136
779
19266
7457
5881
20141
24857
15332
25686
28400
21157
12290
3352
4571
28672
22258
19686
657
5374
24554
17729
14408
22470
137
21525
17375
16704
5702
17930
23099
26234
26816
15328
7991
18050
4944
1616
21255
15618
14965
14081
14578
21201
17275
24291
29086
30129
29414
6742
29565
10682
20327
11928
24859
20640
15722
27787
24196
25780
4342
18923
8064
12141
1239
16242
9884
17777
17781
30066
5964
11931
6941
29773
16244
19986
1478
25408
10799
22640
835
14037
7811
16994
4901
12085
18411
4512
17854
21743
23346
16406
18167
7061
14444
10555
17631
14390
19365
2311
26645
861
22482
11072
17641
20468
6426
26840
9306
25594
19615
26101
7280
27250
29911
12623
8826
11719
22919
6067
21116
6160
6626
11124
7517
6592
7431
578
28135
9882
12345
1820
12053
25948
9758
14063
27899
26902
3020
14898
15852
22477
26555
10825
3008
8099
23455
24724
615
17950
6038
6888
4185
27253
12928
28879
27302
16115
17732
19699
12732
13802
14584
24644
7355
24674
2465
22063
11502
10832
10389
11776
6909
4168
18156
27178
14854
27538
5146
19657
30157
23238
6801
17119
2081
6382
11750
26484
1622
19510
8559
9983
3089
24274
27921
4769
26609
11762
1025
11596
28974
28318
6109
18253
23189
5457
24490
13861
21145
25010
29564
3117
24212
15980
16711
13308
14448
21488
18994
29573
2372
28573
8921
25479
16834
16903
14637
24773
11576
4062
17222
14005
11324
27407
7973
862
29140
13596
10870
11409
3315
4485
26374
26685
3864
2853
22803
18092
6043
26197
25232
7948
24391
22037
15243
22692
7448
14399
8593
21402
1787
11949
400
503
26731
27050
22237
10044
13082
15681
20581
7288
28495
594
11889
13983
24086
6850
10670
24005
25551
25151
4043
18962
1001
3991
21419
26870
6174
674
20050
13330
20984
4375
24407
21991
24571
7395
4236
8264
9767
30330
18625
12283
23423
7724
23606
25788
28934
19456
12565
27882
25925
3416
5639
5289
5650
26310
605
12395
28381
24173
8181
7554
21238
8230
24852
17037
444
9581
18109
23288
13271
21181
1009
26112
11093
3731
8086
29982
23471
19714
18685
1499
25537
12991
8742
4757
18062
1356
16795
4240
20264
8344
26263
13756
15963
21413
21565
30136
15446
4475
24832
17763
50
14853
6062
28364
2212
14554
22060
6864
22696
22042
13279
16061
24219
11052
10883
12577
26079
11548
4930
5795
3672
25078
4493
28816
24908
29145
18977
15352
23036
24050
3927
24684
8837
11272
22552
3425
20986
1550
4120
3147
16487
18654
3371
29484
9078
21372
13690
9774
8543
27274
9869
19961
13973
27445
14791
29187
9202
23820
4561
6308
5709
16992
27264
3954
30255
29945
25737
13122
29018
24537
20181
5301
22001
5052
24631
7619
15425
5573
15449
29305
1365
11001
18523
1061
23390
27025
12226
25016
19420
15855
29966
12522
10615
13935
25653
29121
26723
20392
9594
5991
15898
27409
28090
3318
18369
5950
15266
1485
26869
7117
29738
15484
23167
1161
11701
5299
21572
1697
24452
3259
13416
27543
13738
7840
6668
29387
13342
16461
16882
3427
12302
11517
270
23911
25793
25877
6247
5394
15194
25389
3306
15117
12317
27558
14518
13731
18036
10472
22994
29263
21515
10510
17204
8694
29264
14634
11869
11716
12137
11983
4704
14778
3716
6167
11184
19819
26972
25717
5414
5097
18810
3704
22976
2668
1047
14468
19548
9366
22363
21431
21446
13640
7444
25604
441
26581
13488
7019
24318
7874
24652
22352
1117
8703
5977
2823
4866
7115
17802
26608
24042
11431
27773
14344
5794
28545
20647
11329
21511
14608
25530
26301
4838
15823
1192
9592
24604
23176
12461
20523
3624
24355
29870
8198
18832
5001
16730
5382
25742
3453
23600
11313
3942
19446
25679
1887
5548
11613
26179
21523
5229
29303
8028
20239
28554
570
24677
13359
401
7684
4742
782
13878
14193
7318
3252
1718
182
27317
19916
13463
12377
2751
18748
3838
15426
15557
4560
13362
3656
7622
1719
14092
21944
23852
12758
24249
1579
6929
14315
4672
11317
25553
11711
22663
7445
5137
18797
22198
22129
28867
1928
2566
9835
29400
29366
9398
9571
30109
4775
21740
12531
16275
17776
25328
26970
17495
2296
27514
5483
2946
4847
30038
21115
10748
4338
24040
14148
14612
22092
8012
26473
22440
2163
16516
13943
17558
17643
4181
19760
25007
28206
27075
8033
1960
23688
2411
30090
23314
18285
18521
1829
12371
3303
2226
24942
29152
213
27881
14338
27600
3930
26593
25614
15380
5552
11090
29843
20627
27187
2167
12889
1140
4935
24001
3883
29693
14155
9974
6654
29780
17271
6143
14685
380
4272
9393
26885
2633
15192
29623
21784
4826
5340
13702
3258
5638
6250
29272
7660
20103
3751
16669
16809
27268
13810
16004
16978
17927
11579
24782
1373
29706
29042
8446
21106
19656
29883
23527
27122
10097
22567
5819
13972
23761
14727
3127
9859
15678
21187
16942
4050
11279
15743
9092
8196
27593
4061
21056
1306
17135
14703
4615
28270
16676
15149
12271
20341
15654
19648
6293
27483
16260
26480
26474
23159
2001
2555
3281
10337
20920
15641
23439
13573
22722
15971
2334
27284
25913
23920
26200
12431
27447
18662
7814
2961
23902
27749
24551
9274
16008
10232
26977
19835
20642
20557
11571
22317
16816
28988
7331
30276
28649
14786
23426
3952
9317
19792
12210
22073
3057
12328
14158
9573
26364
24224
13137
10294
15843
5458
8916
2031
10149
4215
5384
1087
3642
6491
6076
20352
30326
18402
4572
20687
30067
21996
28575
22398
23153
29752
22761
14347
609
26521
3690
23993
18886
9447
1296
24827
21324
2769
5439
29590
18777
27565
21566
3021
2846
23284
22547
1285
13942
24820
2312
7138
5896
18694
4583
23365
27810
7094
25826
25413
22592
199
4559
10465
23080
230
10697
2080
5646
3364
9812
29193
10808
18081
23559
25767
6677
6242
27509
24978
24625
14420
526
19639
25006
25701
26191
4897
22487
11151
15343
66
23309
29138
28308
11473
1889
26247
22413
249
11347
16427
22658
18196
10771
5643
7387
20964
9073
9558
4770
16956
21097
13940
7345
6918
29274
19079
24784
26476
10432
21365
29204
11879
16038
19300
21215
564
24524
25531
26026
20551
17155
2000
20608
24357
23890
2302
20252
28336
12682
15988
2274
12272
19887
21608
20087
11389
17390
11866
11169
22694
14719
12082
16729
26084
26329
17146
11564
846
24853
28464
18321
14906
20857
3613
11427
27245
2407
27298
12074
10219
7220
19322
1107
10252
21182
13281
114
22617
14049
20140
4005
27113
4973
25167
24163
10980
14330
19825
15296
18603
22520
23693
55
4445
4174
18987
23899
29346
29748
44
24678
26786
17952
5886
18097
1797
17695
13568
257
18545
8993
7941
7746
28519
13685
6136
10851
23219
10934
3299
28101
1214
2429
13194
19807
15922
11661
19860
7347
25029
13097
1305
18140
5774
23484
4795
18372
16485
9539
4082
27388
15059
16081
23357
10156
7601
6213
17593
20248
22678
13072
15353
20228
7159
19528
6896
24973
18363
13921
12064
9328
12360
2640
8144
5845
8761
24671
2998
11447
21669
17472
17127
21124
23406
4516
28449
10134
12458
27190
14121
11157
14171
24120
24400
126
125
12243
12333
12932
2660
14894
7697
18929
26365
27364
23227
29698
17684
19655
7478
4038
13560
14070
23773
1330
27378
23264
30315
4116
2717
15494
24771
1015
16302
17662
14966
20573
17778
9323
13300
10299
4670
4371
15763
5376
22674
27301
7544
20758
8375
11208
599
29160
27746
12508
27613
30032
14267
4302
4725
29505
14122
3588
9180
11368
29919
18700
1198
5730
6974
30152
9511
28764
2511
19823
28746
14276
17367
24435
10444
11400
22488
1701
14430
30115
13830
13905
2867
7898
5520
8246
24876
27978
21895
275
18134
10613
17036
4343
6853
9910
27403
14058
24492
29221
5041
23938
1854
9215
22794
26599
17027
20574
23100
29227
16975
1610
10224
11519
24293
12768
5359
16685
10349
2119
19455
7742
10828
7063
3925
1254
9027
20113
7521
20826
26466
18558
1361
27994
23631
16175
7896
9472
4570
17395
10402
7870
14350
5657
22164
18241
13108
25424
27334
16750
10949
29273
2700
14507
5800
25055
11622
16928
20914
1560
27304
20292
18572
15228
21813
26662
29182
17849
19650
20596
7136
10473
21287
25401
30339
15147
20065
18842
12462
10649
13041
22223
27345
14337
7588
8207
19333
26018
18846
7217
23553
26242
4003
8333
21652
23311
28673
24442
23913
8506
1335
25863
131
18117
4337
11543
15616
2359
21598
6977
5249
1520
14535
26249
13538
5773
4574
23961
688
16897
22432
25869
8096
2016
28231
28942
21893
22407
11367
23111
10323
20396
4722
14204
4318
9493
14710
23846
16390
27316
3551
24290
29329
2263
25062
24092
20390
29024
22779
14279
10709
9333
23947
24170
2929
25493
12987
3835
7152
15809
8498
13448
17481
4474
14425
4266
11476
17748
27240
11403
21780
10182
17667
12222
7155
18135
12375
3166
24972
11621
12583
18078
22693
22320
12806
23083
12399
27258
9368
28631
14901
28666
4635
1987
7568
26973
25628
2319
12324
15612
3050
26871
4436
15015
25675
22178
2654
7927
2506
18918
8420
27416
24272
13381
13873
15109
958
805
20120
17949
27800
14573
15965
6093
17725
28643
2773
28846
27148
7183
20131
29513
27803
7299
29838
23994
28922
14900
17296
17399
25449
19899
19833
20420
709
23746
15212
17565
15859
18457
12912
13384
26827
29653
3201
6514
24353
373
14453
9046
17792
15588
20841
23632
2297
9996
1786
16128
2439
25184
3722
1757
16003
21679
22825
13222
9101
20191
8701
24845
8447
28638
27717
8832
8792
3402
27947
24003
24811
13982
19859
13060
4110
23497
15778
19418
6747
11923
29836
7223
7559
19437
8630
27542
3730
11856
1179
7319
28542
8337
8781
8113
22159
30160
17394
14001
22846
28799
26190
27286
13442
6023
21889
8480
22306
14916
7953
29975
11655
22236
14969
20459
5979
5115
21560
4344
24049
30210
1056
30209
27229
14775
30022
7978
5738
26385
6993
20107
14343
22530
8810
21222
26253
11297
22264
10538
16558
20620
